# 4.9 Data Visualization Part 1

In [2]:
import pandas as pd
import numpy as np
import os

In [4]:
path = r'C:\Users\aaron\OneDrive\Documents\CF Analysis 4'

In [6]:
df_opm = pd.read_pickle(os.path.join(path, '2 Data', 'Prepared Data', 'ords_prods_merge++'))

In [8]:
df_ct = pd.read_csv(os.path.join(path, '2 Data', 'Original Data', 'customers.csv'), index_col = False)

Part 4

In [12]:
df_ct.shape

(206209, 10)

In [14]:
# checking the new dataset
df_ct.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Looking at the key questions of the Project Brief, and the directions for part 2, I don't need the day people made an acount with us. I'm also going to remove the names because that will cause this already massive data set to be even more inflated.

In [17]:
df_ct = df_ct.drop(columns = ['date_joined', 'First Name', 'Surnam'])

In [19]:
df_ct.head()

   user_id  Gender       STATE  Age  n_dependants fam_status  income
0    26711  Female    Missouri   48             3    married  165665
1    33890  Female  New Mexico   36             0     single   59285
2    65803    Male       Idaho   35             2    married   99568
3   125935  Female        Iowa   40             0     single   42049
4   130797  Female    Maryland   26             1    married   40374

There are multiple columns that are in need of a name change to make it more readable

In [22]:
df_ct.rename(columns = {'STATE' : 'U.S. State'}, inplace = True)

In [24]:
df_ct.rename(columns = {'n_dependants' : '#dependants'}, inplace = True)

In [26]:
df_ct.rename(columns = {'fam_status' : 'Family Status'}, inplace = True)

In [28]:
df_ct.head()

   user_id  Gender  U.S. State  Age  #dependants Family Status  income
0    26711  Female    Missouri   48            3       married  165665
1    33890  Female  New Mexico   36            0        single   59285
2    65803    Male       Idaho   35            2       married   99568
3   125935  Female        Iowa   40            0        single   42049
4   130797  Female    Maryland   26            1       married   40374

In [30]:
# checking data types
df_ct.dtypes

user_id           int64
Gender           object
U.S. State       object
Age               int64
#dependants       int64
Family Status    object
income            int64
dtype: object

The data type fore user_id needs to be changed

In [33]:
df_ct['user_id'] = df_ct['user_id'].astype('str')

In [35]:
df_ct['user_id'].dtypes

dtype('O')

In [37]:
# doing the same thing on the other dataset in preperation of merging the two
df_opm['user_id'] = df_opm['user_id'].astype('str')

In [39]:
df_opm['user_id'].dtypes

dtype('O')

Part 5

In [43]:
# quality checks
df_ct.describe()

                 Age    #dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

The max for income is an outlier, but from the info I have I can't say if this value is an error or is genuine

In [46]:
# missing values check
df_ct.isnull().sum()

user_id          0
Gender           0
U.S. State       0
Age              0
#dependants      0
Family Status    0
income           0
dtype: int64

No missing values

In [49]:
# duplicate values check
df_dups = df_ct[df_ct.duplicated()]

In [51]:
df_dups

Empty DataFrame
Columns: [user_id, Gender, U.S. State, Age, #dependants, Family Status, income]
Index: []

No duplicated values

In [54]:
#mixed value check
df_ct['Gender'].value_counts(dropna = False)

Gender
Male      104067
Female    102142
Name: count, dtype: int64

In [56]:
df_ct['U.S. State'].value_counts(dropna = False)

U.S. State
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

In [58]:
df_ct['#dependants'].value_counts(dropna = False)

#dependants
0    51602
3    51594
1    51531
2    51482
Name: count, dtype: int64

In [60]:
df_ct['Family Status'].value_counts(dropna = False)

Family Status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

No mixed values

Part 6

In [65]:
df_opm.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'number_of_consecutive_orders',
       'orders_day_of_week', 'order_hour_of_day', 'days_since_prior_order',
       'add_to_cart_order', 'reordered', '_merge', 'price_range_loc',
       'busiest_day', 'Busiest_days', 'busiest_period_of_day', 'max_order',
       'loyalty_flag', 'mean_spending', 'spending_flag', 'order_frequency',
       'order_frequency_flag'],
      dtype='object')

In [67]:
# Removing unnecessary columns from the opm data set
df_opm = df_opm.drop(columns = ['_merge', 'max_order', 'mean_spending', 'order_frequency', 'busiest_day', 'aisle_id'])

In [69]:
df_opm.shape

(32404859, 18)

In [71]:
df_ct.shape

(206209, 7)

In [73]:
# Inner Merge
df_full = df_opm.merge(df_ct, on = 'user_id', indicator = True)

In [75]:
df_full.shape

(32404859, 25)

In [77]:
df_full['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

Part 8

In [81]:
# Exporting
df_full.to_pickle(os.path.join(path, '2 Data','Prepared Data', 'full_set'))